NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG22/EFR32BG22C224F512GM40.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HFXO0_S</name>
      <version>2</version>
      <description>HFXO0_S Registers</description>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HFXO0</name>
        <value>44</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALCFG</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x044334CB</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>COREBIASSTARTUPI</name>
              <description>Intermediate Startup Core Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COREBIASSTARTUP</name>
              <description>Startup Core Bias Current</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNEXISTARTUP</name>
              <description>Startup Tuning Capacitance on XI</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNEXOSTARTUP</name>
              <description>Startup Tuning Capacitance on XO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTSTEADY</name>
              <description>Steady State Timeout</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T16US</name>
                  <description>The steady state timeout is set to 16 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T41US</name>
                  <description>The steady state timeout is set to 41 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The steady state timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T125US</name>
                  <description>The steady state timeout is set to 125 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T166US</name>
                  <description>The steady state timeout is set to 166 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The steady state timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T250US</name>
                  <description>The steady state timeout is set to 250 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T333US</name>
                  <description>The steady state timeout is set to 333 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T416US</name>
                  <description>The steady state timeout is set to 416 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T500US</name>
                  <description>The steady state timeout is set to 500 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T666US</name>
                  <description>The steady state timeout is set to 666 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T833US</name>
                  <description>The steady state timeout is set to 833 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T1666US</name>
                  <description>The steady state timeout is set to 1666 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2500US</name>
                  <description>The steady state timeout is set to 2500 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T4166US</name>
                  <description>The steady state timeout is set to 4166 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T7500US</name>
                  <description>The steady state timeout is set to 7500 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTCBLSB</name>
              <description>Core Bias LSB Change Timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T8US</name>
                  <description>The core bias LSB change timeout is set to 8 us minimum.  The maximum can be +40%.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T20US</name>
                  <description>The core bias LSB change timeout is set to 20 us minimum.  The maximum can be +40%.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T41US</name>
                  <description>The core bias LSB change timeout is set to 41 us minimum.  The maximum can be +40%.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T62US</name>
                  <description>The core bias LSB change timeout is set to 62 us minimum.  The maximum can be +40%.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T83US</name>
                  <description>The core bias LSB change timeout is set to 83 us minimum.  The maximum can be +40%.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T104US</name>
                  <description>The core bias LSB change timeout is set to 104 us minimum.  The maximum can be +40%.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T125US</name>
                  <description>The core bias LSB change timeout is set to 125 us minimum.  The maximum can be +40%.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T166US</name>
                  <description>The core bias LSB change timeout is set to 166 us minimum.  The maximum can be +40%.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T208US</name>
                  <description>The core bias LSB change timeout is set to 208 us minimum.  The maximum can be +40%.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T250US</name>
                  <description>The core bias LSB change timeout is set to 250 us minimum.  The maximum can be +40%.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T333US</name>
                  <description>The core bias LSB change timeout is set to 333 us minimum.  The maximum can be +40%.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T416US</name>
                  <description>The core bias LSB change timeout is set to 416 us minimum.  The maximum can be +40%.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T833US</name>
                  <description>The core bias LSB change timeout is set to 833 us minimum.  The maximum can be +40%.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T1250US</name>
                  <description>The core bias LSB change timeout is set to 1250 us minimum.  The maximum can be +40%.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T2083US</name>
                  <description>The core bias LSB change timeout is set to 2083 us minimum.  The maximum can be +40%.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T3750US</name>
                  <description>The core bias LSB change timeout is set to 3750 us minimum.  The maximum can be +40%.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALCTRL</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x0F8C8C10</resetValue>
          <resetMask>0x8FFFFFFF</resetMask>
          <fields>
            <field>
              <name>COREBIASANA</name>
              <description>Core Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNEXIANA</name>
              <description>Tuning Capacitance on XI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNEXOANA</name>
              <description>Tuning Capacitance on XO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNEFIXANA</name>
              <description>Fixed Tuning Capacitance</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Remove fixed capacitance on XI and XO nodes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XI</name>
                  <description>Adds fixed capacitance on XI node</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO</name>
                  <description>Adds fixed capacitance on XO node</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Adds fixed capacitance on both XI and XO nodes</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COREDGENANA</name>
              <description>Core Degeneration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not apply core degeneration resistence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DGEN33</name>
                  <description>Apply 33 ohm core degeneration resistence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DGEN50</name>
                  <description>Apply 50 ohm core degeneration resistence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DGEN100</name>
                  <description>Apply 100 ohm core degeneration resistence</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPCOREBIASOPT</name>
              <description>Skip Core Bias Optimization</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xF000000D</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Crystal Oscillator Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>crystal oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>external sinusoidal clock can be supplied on XI pin.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENXIDCBIASANA</name>
              <description>Enable XI Internal DC Bias</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQBUFSCHTRGANA</name>
              <description>Squaring Buffer Schmitt Trigger</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Squaring buffer schmitt trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Squaring buffer schmitt trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x80000037</resetMask>
          <fields>
            <field>
              <name>FORCEEN</name>
              <description>Force Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMAND</name>
              <description>Disable On-demand Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEPWARM</name>
              <description>Keep Warm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEXI2GNDANA</name>
              <description>Force XI Pin to Ground</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEXO2GNDANA</name>
              <description>Force XO Pin to Ground</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>COREBIASOPT</name>
              <description>Core Bias Optimizaton</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MANUALOVERRIDE</name>
              <description>Manual Override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
