NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG22/EFR32BG22C224F512GM40.svd
        <register>
          <name>DSMCTRLTX</name>
          <description>No Description</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000013</resetValue>
          <resetMask>0x070003FF</resetMask>
          <fields>
            <field>
              <name>DITHERDSMINPUTTX</name>
              <description>Dithering of DSM input for TX mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DITHERDSMOUTPUTTX</name>
              <description>Dithering of DSM output for TX mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DITHERDACTX</name>
              <description>Dithering of charge pump DAC for TX mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSMMODETX</name>
              <description>Delta-sigma topology for TX mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEEDFORWARD</name>
                  <description>Feed forward architecture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASH</name>
                  <description>MASH architecture. Note that the delta-sigma output dithering (DITHERDSMOUTPUT) is not available in this mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSBFORCETX</name>
              <description>Delta-sigma input force LSB for TX mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMMODETX</name>
              <description>DEM Mode for TX mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DEM is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DEM is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASHORDERTX</name>
              <description>MASH order for TX mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECOND</name>
                  <description>2nd Order Mash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRD</name>
                  <description>3rd Order Mash</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQORDERTX</name>
              <description>ReQuant order for TX mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRST</name>
                  <description>1st Order DAC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND</name>
                  <description>2rd Order DAC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQIF</name>
          <description>No Description</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000237</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>Synthesizer locked Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCKED</name>
              <description>Synthesizer unlocked Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYRDY</name>
              <description>Synthesizer ready Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOHIGH</name>
              <description>VCO high voltage Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOLOW</name>
              <description>VCO low voltage Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCNTDONE</name>
              <description>LOCNT measurement done Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQIEN</name>
          <description>No Description</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000237</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>LOCKED Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCKED</name>
              <description>UNLOCKED Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYRDY</name>
              <description>CAPCALDONE Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOHIGH</name>
              <description>VCOHIGH Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOLOW</name>
              <description>VCOLOW Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCNTDONE</name>
              <description>LOCNTDONE Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
